Revit 2027 API
DocumentChangedEventArgs.GetModifiedElementIds Method
 Returns set of elements that were modified.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetModifiedElementIds()
Public Function GetModifiedElementIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetModifiedElementIds()
member GetModifiedElementIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The set of ElementId for elements that were modified.
See Also
Reference
DocumentChangedEventArgs Class
GetModifiedElementIds Overload
Autodesk.Revit.DB.Events Namespace